public/man/man1/btattach.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - btattach.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - btattach.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>btattach - Attach serial devices to BlueZ stack</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>btattach</strong> [*-B* /device/] [*-A* /device/] [*-P* /protocol/] [*-R*]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p><strong>btattach(1)</strong> is used to attach a serial UART to the Bluetooth stack as
a transport interface.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<blockquote>
<dl>
<dt>
<strong>-B*/ device,/</strong> –brder*/ device/
</dt>
<dd>Attach a BR/EDR controller</dd>
<dt>
<strong>-A*/ device,/</strong> –amp*/ device/
</dt>
<dd>Attach an AMP controller</dd>
<dt>
<strong>-P*/ protocol,/</strong> –protocol*/ protocol/
</dt>
<dd>Specify the protocol type
for talking to the device.

Supported values are:</dd>
</dl>
</blockquote>
<table>
<tbody>
<tr>
<td><em>protocol</em></td>
</tr>
<tr>
<td>_</td>
</tr>
<tr>
<td>h4</td>
</tr>
<tr>
<td>_</td>
</tr>
<tr>
<td>bcsp</td>
</tr>
<tr>
<td>_</td>
</tr>
<tr>
<td>3wire</td>
</tr>
<tr>
<td>_</td>
</tr>
<tr>
<td>h4ds</td>
</tr>
<tr>
<td>_</td>
</tr>
<tr>
<td>ll</td>
</tr>
<tr>
<td>_</td>
</tr>
<tr>
<td>ath3k</td>
</tr>
<tr>
<td>_</td>
</tr>
<tr>
<td>intel</td>
</tr>
<tr>
<td>_</td>
</tr>
<tr>
<td>bcm</td>
</tr>
<tr>
<td>_</td>
</tr>
<tr>
<td>qca</td>
</tr>
</tbody>
</table>
<blockquote>
<dl>
<dt>
<strong>-S*/ baudrate,/</strong> –speed*/ baudrate/
</dt>
<dd>Specify wich baudrate to use</dd>
<dt>
<strong>-N, –noflowctl</strong>
</dt>
<dd>Disable flow control</dd>
<dt>
<strong>-v, –version</strong>
</dt>
<dd>Show version</dd>
<dt>
<strong>-h, –help</strong>
</dt>
<dd>Show help options</dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
RESOURCES
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>&lt;http://www.bluez.org&gt;</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
REPORTING BUGS
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>&lt;linux-bluetooth@vger.kernel.org&gt;</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
COPYRIGHT
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>Free use of this software is granted under ther terms of the GNU Lesser
General Public Licenses (LGPL).</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
